backend/performance-tests/artillery/load-test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Warm up phase"
    - duration: 120
      arrivalRate: 10
      name: "Sustained load"
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Get All Reports"
    weight: 40
    flow:
      - get:
          url: "/api/reports"
          expect:
            - statusCode: 200
      - think: 1

  - name: "Get Categories"
    weight: 30
    flow:
      - get:
          url: "/api/categories"
          expect:
            - statusCode: 200
      - think: 1

  - name: "Login Flow"
    weight: 30
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "admin@urbana.com"
            password: "admin123"
          expect:
            - statusCode: 200