backend/performance-tests/artillery/stress-test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 30
      arrivalRate: 10
      name: "Ramp up"
    - duration: 60
      arrivalRate: 30
      name: "High load"
    - duration: 30
      arrivalRate: 50
      name: "Stress test"
    - duration: 30
      arrivalRate: 5
      name: "Cool down"

scenarios:
  - name: "API Stress Test"
    flow:
      - get:
          url: "/api/reports"
      - think: 0.5
      - get:
          url: "/api/categories"
      - think: 0.5
      - post:
          url: "/api/auth/login"
          json:
            email: "admin@urbana.com"
            password: "admin123"